#include <iostream>
#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_ALL, "");





	/*4.	Даны два ненулевых числа.Найти сумму, разность, произведение и частное их квадратов.*/



	/*3.	Требуется сложить два целых числа А и В.*/
	//int x, y;
	//printf("x= ");
	//scanf_s("%d", &x);

	//printf("y= ");
	//scanf_s("%d", &y);
	//
	//int z = x * y;
	//printf("Сумма = ");
	//printf("%d\n", z);

	////2.	Однажды, посетив магазин канцелярских товаров, Вася купил X карандашей, Y ручек и Z фломастеров.Известно,
	////	что цена ручки на 2 рубля больше цены карандаша и на 7 рублей меньше цены фломастера.Также известно,
	////	что стоимость карандаша составляет 3 рубля.Требуется определить общую стоимость покупки.
	////	(Входные данные : записаны три натуральных числа X, Y и Z, каждое из которых не превышает 109).

	//printf("Карандаш = 3\n");
	//printf("Ручка = 5 \n");
	//printf("Фломастеры = 10\n");

	//int x, y,z;
	//printf("Кол-во карандашей = ");
	//scanf_s("%d", &x);

	//printf("Кол-во ручек = ");
	//scanf_s("%d", &y);

	//printf("Кол-во фломастеров = ");
	//scanf_s("%d", &z);

	//int q = (x * 3) + (y * 5) + (z * 10);
	//printf("Сумма = ");
	//printf("%d\n", q);

	////1.	Даны действительные числа x и y.Получить: (x - y) / 1 + (xy)

	//int x, y;
	//printf("x= ");
	//scanf_s("%d", &x);

	//printf("y= ");
	//scanf_s("%d", &y);

	//int z = (x - y);

	//printf("%d\n", z);

	//int q = (1 + (x*y)) ;

	//printf("%d\n", q);

	//float w = (float)z / q;
	//printf("%f\n", w);
	
	system("pause");

}